# Pandas

Pandas stands for "__Panel Data__" and is the core library for data manipulation and data analysis.
It consists of single and multidimensional data-structures for data manipulation.
single dimensional data structure is known as "__Series__" and multi-dimensional data structure is known as "__Data Frame__".
In pandas, we can import data from various file formats like JSON, CSV(comma-separated values), Microsoft Excel, etc.

When we have to work on Tabular data, we prefer the pandas module.When we have to work on Numerical data, we prefer the numpy module.

The powerful tools of pandas are Data frame and Series.
Whereas the powerful tool of numpy is Arrays.

In [1]:
import pandas as pd

In [13]:
ser = pd.Series([10,20,30,40,50])
print(ser)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [15]:
ser = pd.Series([10,20,30],name='Series1')
print(ser)

0    10
1    20
2    30
Name: Series1, dtype: int64

In [17]:
first=pd.Series([10,2.8,True,40,"hello"])
print(first)
print("********")
print(first.index)
print("********")
print(first.values)

0       10
1      2.8
2     True
3       40
4    hello
dtype: object
********
RangeIndex(start=0, stop=5, step=1)
********
[10 2.8 True 40 'hello']

In [21]:
from pandas import *

mylist=[]
print("enter values, 0 to exit")
while True:
    val=int(input())
    if(val==0):
        break
    mylist.append(val)
myseries=Series(mylist)
print('\n',myseries)

enter values, 0 to exit

 1
 2
 4
 5
 0

 0    1
1    2
2    4
3    5
dtype: int64

In [23]:
mytuple=(100,200,300,400,500)
myseries=Series(mytuple)
print(myseries)

0    100
1    200
2    300
3    400
4    500
dtype: int64

In [29]:
first=pd.Series([10,20,30,40,50])
print(first.to_string(index=False))

10
20
30
40
50

In [33]:
first=Series([100,200,300,400,500])
print(type(first))

<class 'pandas.core.series.Series'>

In [35]:
first=Series([10,20,30,40,50],index=['p','q','r','s','t'])
print(first)

p    10
q    20
r    30
s    40
t    50
dtype: int64

In [37]:
mydict=({1:'Sachin',2:'Rahul',3:'Anil',4:'Rohit'})
print(mydict)
print("\n")
print(type(mydict))
print("Let's create Series from a dictionary")
myseries=Series(mydict)
print(myseries)
print(myseries.index)
print(myseries.values)

{1: 'Sachin', 2: 'Rahul', 3: 'Anil', 4: 'Rohit'}


<class 'dict'>
Let's create Series from a dictionary
1    Sachin
2     Rahul
3      Anil
4     Rohit
dtype: object
Index([1, 2, 3, 4], dtype='int64')
['Sachin' 'Rahul' 'Anil' 'Rohit']

In [47]:
myseries=Series([10,20,30,40,50])
print(myseries,'\n')
myseries.index=['a','b','c','d','e']
print(myseries,'\n')
print(myseries.iloc[0])
myseries.iloc[1]=65   # possible
print(myseries)

0    10
1    20
2    30
3    40
4    50
dtype: int64

a    10
b    20
c    30
d    40
e    50
dtype: int64

10
a    10
b    65
c    30
d    40
e    50
dtype: int64

In [49]:
myseries=Series([10,20,30,40,50,60,70,80])
print(myseries)
print("\n")
print(myseries[5])              # extract 5th element
print("\n")
print(myseries[2:6])            # extract elements from 2 to 5
print("\n")
print(myseries[-6:-3])          # extract elements from sixth last to fourth last
print("\n")
print(myseries[:4])             # extract first 4 elements
print("\n")
print(myseries[3:])             # extract elements from the 3rd position

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
dtype: int64


60


2    30
3    40
4    50
5    60
dtype: int64


2    30
3    40
4    50
dtype: int64


0    10
1    20
2    30
3    40
dtype: int64


3    40
4    50
5    60
6    70
7    80
dtype: int64

In [51]:
# adding a scalar value to series elements  and adding two series

from pandas import *
myseries=Series([10,20,30,40,50])
print(myseries)
print("\n")
print(myseries+4)
print("\n")
myseries1=Series([1,2,3,4,5])
print(myseries+myseries1)

0    10
1    20
2    30
3    40
4    50
dtype: int64


0    14
1    24
2    34
3    44
4    54
dtype: int64


0    11
1    22
2    33
3    44
4    55
dtype: int64

In [53]:
myseries=Series([10,20,30,40,50,60])
print(myseries)
print("\n")
print(myseries.sum())
print("\n")
print(myseries.add(3))
print("\n")
print(myseries.subtract(5))
print("\n")
print(myseries.divide(2))
print("\n")
print(myseries.mul(4))

0    10
1    20
2    30
3    40
4    50
5    60
dtype: int64


210


0    13
1    23
2    33
3    43
4    53
5    63
dtype: int64


0     5
1    15
2    25
3    35
4    45
5    55
dtype: int64


0     5.0
1    10.0
2    15.0
3    20.0
4    25.0
5    30.0
dtype: float64


0     40
1     80
2    120
3    160
4    200
5    240
dtype: int64

## DataFrame
##### DataFrame is a two dimensional labelled data structure
##### DataFrame comprises of rows and columns

In [64]:
mydict={"Name":['Sachin','Rahul','Anil'],"Age":[30,35,38]}
df=DataFrame(mydict,index=[1,2,3])
df

     Name  Age
1  Sachin   30
2   Rahul   35
3    Anil   38

In [60]:
type(df)

pandas.core.frame.DataFrame

In [66]:
mydataframe=DataFrame({"proid":range(1,5),"proname":['soap','perfume','deo','powder']})
mydataframe

   proid  proname
0      1     soap
1      2  perfume
2      3      deo
3      4   powder

In [68]:
mydataframe["proid"].values.tolist()       # extract values of "proid" only and convert them to list

[1, 2, 3, 4]

In [70]:
mydataframe[["proname","proid"]].values.tolist() # extract values of "proname and proid" and convert them to list

[['soap', 1], ['perfume', 2], ['deo', 3], ['powder', 4]]

In [72]:
mydataframe[["proid","proname"]].values.tolist()

[[1, 'soap'], [2, 'perfume'], [3, 'deo'], [4, 'powder']]

In [74]:
mydataframe=DataFrame({"proid":range(1,5),"proname":['soap','perfume','deo','powder']})
mydataframe

   proid  proname
0      1     soap
1      2  perfume
2      3      deo
3      4   powder

In [ ]:
mydataframe.loc[[0]].values.tolist()

In [78]:
mydataframe.loc[[1,3]].values.tolist()   # extract row no. 1 and 3

[[2, 'perfume'], [4, 'powder']]

In [80]:
mydataframe.iloc[:,0:1].values.tolist()    #  extract all rows of 0 to 1 columns, 1 is exclusive

[[1], [2], [3], [4]]

In [84]:
# extract 1 to 3 rows and 0 to 1 columns
mydataframe.iloc[1:4,:2]

   proid  proname
1      2  perfume
2      3      deo
3      4   powder

##### loc works on the given index of the dataframe rows
##### iloc works on the original index (which always starts from the 0) of the dataframe rows

In [88]:
mydata=DataFrame([100,101,102,103,104],index=['a','b','c','d','e'])
mydata

     0
a  100
b  101
c  102
d  103
e  104

In [92]:
mydata.loc['a':'c']  #c is inclusive

     0
a  100
b  101
c  102

In [100]:
mydata.loc[['b','e']]

     0
b  101
e  104

In [102]:
mydata.iloc[0:3]

     0
a  100
b  101
c  102

In [104]:
df=DataFrame({"proid":range(1,5),"proname":['soap','perfume','deo','powder']})
df

   proid  proname
0      1     soap
1      2  perfume
2      3      deo
3      4   powder

In [110]:
df.loc[(df.proid>2)].values.tolist()

[[3, 'deo'], [4, 'powder']]

In [118]:
df.loc[(df.proname=='perfume')]

   proid  proname
1      2  perfume

In [120]:
df.loc[(df.proname=='deo') | (df.proname=='powder') ]

   proid proname
2      3     deo
3      4  powder

In [128]:
df.loc[0:2]  #2 is inclusive

   proid  proname
0      1     soap
1      2  perfume
2      3      deo

In [134]:
df = DataFrame({"proid":range(5,9),"proname":['soap','perfume','deo','powder'],"price":[120,400,280,160]})
df

   proid  proname  price
0      5     soap    120
1      6  perfume    400
2      7      deo    280
3      8   powder    160

In [136]:
df.iloc[:,[0,2]]

   proid  price
0      5    120
1      6    400
2      7    280
3      8    160

In [138]:
df.iloc[[1,2],[1,2]]

   proname  price
1  perfume    400
2      deo    280

In [150]:
print("let's us read the file in a tradional way")
f=open("Book1.csv","r")
for content in f:
	print(content)
f.close()
print("Done")

let's us read the file in a tradional way
name,age,address

Rohit,35,mumbai

Virat,36,delhi

Sachin,50,mumbai

Ashwin,38,chennai

Bumrah,29,mumbai

Shami,33,banglore

Yuvraj,43,delhi

Dhoni,43,delhi

Sky,29,mumbai

Umesh,30,banglore

Done

##### Now pandas way

In [153]:
df = pd.read_csv('Book1.csv')
df

     name  age   address
0   Rohit   35    mumbai
1   Virat   36     delhi
2  Sachin   50    mumbai
3  Ashwin   38   chennai
4  Bumrah   29    mumbai
5   Shami   33  banglore
6  Yuvraj   43     delhi
7   Dhoni   43     delhi
8     Sky   29    mumbai
9   Umesh   30  banglore

In [159]:
myfile=read_json("details.json")
myfile

     Name  Age   Address
0  Sachin   40    Mumbai
1   Rahul   45  Banglore

In [161]:
df

     name  age   address
0   Rohit   35    mumbai
1   Virat   36     delhi
2  Sachin   50    mumbai
3  Ashwin   38   chennai
4  Bumrah   29    mumbai
5   Shami   33  banglore
6  Yuvraj   43     delhi
7   Dhoni   43     delhi
8     Sky   29    mumbai
9   Umesh   30  banglore

In [167]:
df.loc[:,['name']]

     name
0   Rohit
1   Virat
2  Sachin
3  Ashwin
4  Bumrah
5   Shami
6  Yuvraj
7   Dhoni
8     Sky
9   Umesh

In [173]:
df.head() #top 5 rows

     name  age  address
0   Rohit   35   mumbai
1   Virat   36    delhi
2  Sachin   50   mumbai
3  Ashwin   38  chennai
4  Bumrah   29   mumbai

In [175]:
df.head(2)

    name  age address
0  Rohit   35  mumbai
1  Virat   36   delhi

In [177]:
df.tail()

     name  age   address
5   Shami   33  banglore
6  Yuvraj   43     delhi
7   Dhoni   43     delhi
8     Sky   29    mumbai
9   Umesh   30  banglore

In [179]:
df.describe()

             age
count  10.000000
mean   36.600000
std     6.979335
min    29.000000
25%    30.750000
50%    35.500000
75%    41.750000
max    50.000000

In [181]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     10 non-null     object
 1   age      10 non-null     int64
 2   address  10 non-null     object
dtypes: int64(1), object(2)
memory usage: 372.0+ bytes

In [185]:
df.head(-3)  #print all except last 3 rows

     name  age   address
0   Rohit   35    mumbai
1   Virat   36     delhi
2  Sachin   50    mumbai
3  Ashwin   38   chennai
4  Bumrah   29    mumbai
5   Shami   33  banglore
6  Yuvraj   43     delhi

In [193]:
df.sample() #gives 1 random row

    name  age   address
5  Shami   33  banglore

In [207]:
df.sample(3) #gives 3 random rows

     name  age address
0   Rohit   35  mumbai
4  Bumrah   29  mumbai
2  Sachin   50  mumbai

In [211]:
df.tail(2)   #[-2:]

    name  age   address
8    Sky   29    mumbai
9  Umesh   30  banglore

In [215]:
df.tail(-5) #[-(-5):]==[5:]

     name  age   address
5   Shami   33  banglore
6  Yuvraj   43     delhi
7   Dhoni   43     delhi
8     Sky   29    mumbai
9   Umesh   30  banglore

In [223]:
df.shape

(10, 3)

In [225]:
df.ndim

2

In [229]:
df

     name  age   address
0   Rohit   35    mumbai
1   Virat   36     delhi
2  Sachin   50    mumbai
3  Ashwin   38   chennai
4  Bumrah   29    mumbai
5   Shami   33  banglore
6  Yuvraj   43     delhi
7   Dhoni   43     delhi
8     Sky   29    mumbai
9   Umesh   30  banglore

In [231]:
df1 = df.drop('age',axis=1)

In [233]:
df1

     name   address
0   Rohit    mumbai
1   Virat     delhi
2  Sachin    mumbai
3  Ashwin   chennai
4  Bumrah    mumbai
5   Shami  banglore
6  Yuvraj     delhi
7   Dhoni     delhi
8     Sky    mumbai
9   Umesh  banglore

In [251]:
df = DataFrame({'points': [25, 12, 15, 14, 19, 23, 25, 29],
                   'assists': [5, 7, 7, 9, 12, 9, 9, 4],
                   'rebounds': [11, 8, 10, 6, 6, 5, 9, 12],
                   'blocks': [4, 7, 7, 6, 5, 8, 9, 10]})
df

   points  assists  rebounds  blocks
0      25        5        11       4
1      12        7         8       7
2      15        7        10       7
3      14        9         6       6
4      19       12         6       5
5      23        9         5       8
6      25        9         9       9
7      29        4        12      10

In [253]:
df.iloc[:,[1,2]]

   assists  rebounds
0        5        11
1        7         8
2        7        10
3        9         6
4       12         6
5        9         5
6        9         9
7        4        12

Using numeric_only=True causes df.mean() to ignore columns that contain non-numbers, and only calculate the mean for columns that only contain numbers.

In [256]:
iris=read_csv("iris.csv")
iris

     sepal.length  sepal.width  petal.length  petal.width    variety
0             5.1          3.5           1.4          0.2     Setosa
1             4.9          3.0           1.4          0.2     Setosa
2             4.7          3.2           1.3          0.2     Setosa
3             4.6          3.1           1.5          0.2     Setosa
4             5.0          3.6           1.4          0.2     Setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

[150 rows x 5 columns]

In [258]:
print("\n")
print(iris.mean(numeric_only=True))
print("\n")
print(iris.median(numeric_only=True))
print("\n")
print(iris.min(numeric_only=True))
print("\n")
print(iris.max(numeric_only=True))

sepal.length    5.843333
sepal.width     3.057333
petal.length    3.758000
petal.width     1.199333
dtype: float64


sepal.length    5.80
sepal.width     3.00
petal.length    4.35
petal.width     1.30
dtype: float64


sepal.length    4.3
sepal.width     2.0
petal.length    1.0
petal.width     0.1
dtype: float64


sepal.length    7.9
sepal.width     4.4
petal.length    6.9
petal.width     2.5
dtype: float64

### Export DataFrame to CSVs,JSON files

In [263]:
proid = [1,2,3,4]
proname = ["Soap","Perfume","Deo","Body_Wash"]
price = [120,400,250,180]
 
# dictionary of lists
mydictionary = {'proid':proid,'proname':proname,'price':price}
     
df = pd.DataFrame(mydictionary)
 
df

   proid    proname  price
0      1       Soap    120
1      2    Perfume    400
2      3        Deo    250
3      4  Body_Wash    180

In [265]:
df.to_csv("prod.csv")
df.to_json("prod.json")

In [271]:
df.to_excel("prod.xlsx",sheet_name="prod_sheet",index=False) 
# index=False   is not to include dataframe index inside the excel file

#### The ExcelWriter object allows you to use multiple pandas. DataFrame objects can be exported to separate sheets

In [273]:
proid = [1,2,3,4]
proname = ["Soap","Perfume","Deo","Body_Wash"]
price = [120,400,250,180]
 
# dictionary of lists
mydictionary1 = {'proid':proid,'proname':proname,'price':price}
     
mydataframe1 = pd.DataFrame(mydictionary1)
 


name=['Abc','Xyz','Pqr']
designation=['officer','manager','salesexecutive']
salary=[40000,60000,70000]

mydictionary2={'name':name,'designation':designation,'salary':salary}

mydataframe2=pd.DataFrame(mydictionary2)


with pd.ExcelWriter('Prod1.xlsx') as mywriter:
    mydataframe1.to_excel(mywriter, sheet_name='prod_sheet',index=False)
    mydataframe2.to_excel(mywriter, sheet_name='employee_sheet',index=False)

Works same as

In [ ]:

try:
    mywriter = pd.ExcelWriter('Prod1.xlsx')
    mydataframe1.to_excel(mywriter, sheet_name='prod_sheet', index=False)
    mydataframe2.to_excel(mywriter, sheet_name='employee_sheet', index=False)
except Exception as e:
    print(f"An error occurred: {e}")
finally:
    mywriter.close()

## Sort

In [6]:
first=pd.Series([100,20,3,40,5])
print(first)
print("sorting Pandas values without indexes changed")
print(first.sort_values())

0    100
1     20
2      3
3     40
4      5
dtype: int64
sorting Pandas values without indexes changed
2      3
4      5
1     20
3     40
0    100
dtype: int64

In [8]:
print("sorting Pandas values with indexes changed")
print(first.sort_values(ignore_index=True))

sorting Pandas values with indexes changed
0      3
1      5
2     20
3     40
4    100
dtype: int64

In [12]:
print("sorting in descending order ,Pandas values with indexes changed")
print(first.sort_values(ascending=False,ignore_index=True))

sorting in descending order ,Pandas values with indexes changed
0    100
1     40
2     20
3      5
4      3
dtype: int64

In [28]:
mydict={"Name":['Sachin','Rahul','Anil'],"Age":[39,35,38]}
mydataframe=pd.DataFrame(mydict)
mydataframe

     Name  Age
0  Sachin   39
1   Rahul   35
2    Anil   38

In [20]:
print("Age-wise ascending sort")
mydataframe.sort_values(by="Age",ignore_index=True)

Age-wise ascending sort

     Name  Age
0   Rahul   35
1    Anil   38
2  Sachin   39

In [22]:
print("Age-wise descending sort")
mydataframe.sort_values(by="Age",ascending=False,ignore_index=True)

Age-wise descending sort

     Name  Age
0  Sachin   39
1    Anil   38
2   Rahul   35

In [24]:
print("Name-wise ascending sort")
mydataframe.sort_values(by="Name",ignore_index=True)

Name-wise ascending sort

     Name  Age
0    Anil   38
1   Rahul   35
2  Sachin   39

In [26]:
print("Name-wise descending sort")
mydataframe.sort_values(by="Name",ascending=False,ignore_index=True)

Name-wise descending sort

     Name  Age
0  Sachin   39
1   Rahul   35
2    Anil   38

## Data Wrangling 
It is the process of gathering, collecting, and transforming Raw data into another format for better understanding, decision-making, accessing, and analysis in less time. Data Wrangling is also known as Data Munging.

Data wrangling in Python deals with the below functionalities:

Data exploration: In this process, the data is studied, analyzed, and understood by visualizing representations of data.
Dealing with missing values: Most of the datasets having a vast amount of data contain missing values of NaN, they are needed to be taken care of by replacing them with mean, mode, the most frequent value of the column, or simply by dropping the row having a NaN value.
Reshaping data: In this process, data is manipulated according to the requirements, where new data can be added or pre-existing data can be modified.
Filtering data: Some times datasets are comprised of unwanted rows or columns which are required to be removed or filtered.

Data wrangling involves processing the data in various formats like - merging, grouping, concatenating etc. for the purpose of analysing or getting them ready to be used with another set of data.

##### scenario

duplicate registration done by students, we need to remove the names which have been registered more than once.

In [32]:
student_data = {'Name': ['Sachin', 'Praveen', 'Jagruti',
                         'Sharath', 'Vishal', 'Suraj',
                         'Rohit', 'Satyapal', 'Sachin',
                         'Sharath', 'Suraj', 'Sachin'],

                'Prn_No': [23, 54, 29, 36, 59, 38,
                            12, 45, 34, 36, 38, 23],
                'Email': ['xxxx@gmail.com', 'xxxxxx@gmail.com',
                          'xxxxxx@gmail.com', 'xx@gmail.com',
                          'xxxx@gmail.com', 'xxxxx@gmail.com',
                          'xxxxx@gmail.com', 'xxxx@gmail.com',
                          'xxxxx@gmail.com', 'xx@gmail.com',
                          'xxxxx@gmail.com', 'xxxx@gmail.com']}

In [34]:
from pandas import *
# creating dataframe
df = DataFrame(student_data)
print("original data set is")
df

original data set is

        Name  Prn_No             Email
0     Sachin      23    xxxx@gmail.com
1    Praveen      54  xxxxxx@gmail.com
2    Jagruti      29  xxxxxx@gmail.com
3    Sharath      36      xx@gmail.com
4     Vishal      59    xxxx@gmail.com
5      Suraj      38   xxxxx@gmail.com
6      Rohit      12   xxxxx@gmail.com
7   Satyapal      45    xxxx@gmail.com
8     Sachin      34   xxxxx@gmail.com
9    Sharath      36      xx@gmail.com
10     Suraj      38   xxxxx@gmail.com
11    Sachin      23    xxxx@gmail.com

In [36]:
df.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9      True
10     True
11     True
dtype: bool

In [38]:
non_duplicate = df[~df.duplicated('Prn_No')]
non_duplicate

       Name  Prn_No             Email
0    Sachin      23    xxxx@gmail.com
1   Praveen      54  xxxxxx@gmail.com
2   Jagruti      29  xxxxxx@gmail.com
3   Sharath      36      xx@gmail.com
4    Vishal      59    xxxx@gmail.com
5     Suraj      38   xxxxx@gmail.com
6     Rohit      12   xxxxx@gmail.com
7  Satyapal      45    xxxx@gmail.com
8    Sachin      34   xxxxx@gmail.com

In [40]:
CDAC_Placement_data = {'Center': ['VITA', 'VITA', 'VITA',
                              'VITA', 'MET', 'YCP',
                              'Khaarghar', 'CDAC_Juhu', 'CDAC_Juhu',
                              ],
                    'Year': [2020, 2021, 2022, 2019,
                             2020, 2022, 2020, 2019,
                             2020],
                    'Placement_ratio': [96, 99, 92, 99, 95, 85,
                             92, 88, 87]}

# Creating Dataframe for Provided Data
df = pd.DataFrame(CDAC_Placement_data)
df

      Center  Year  Placement_ratio
0       VITA  2020               96
1       VITA  2021               99
2       VITA  2022               92
3       VITA  2019               99
4        MET  2020               95
5        YCP  2022               85
6  Khaarghar  2020               92
7  CDAC_Juhu  2019               88
8  CDAC_Juhu  2020               87

In [44]:
grouped = df.groupby('Year')
grouped.groups

{2019: [3, 7], 2020: [0, 4, 6, 8], 2021: [1], 2022: [2, 5]}

In [46]:
grouped.get_group(2020)

      Center  Year  Placement_ratio
0       VITA  2020               96
4        MET  2020               95
6  Khaarghar  2020               92
8  CDAC_Juhu  2020               87

In [50]:
# Creating Dataframe
students_data = pd.DataFrame({
    'Prn_No': [101, 102, 103, 104, 105,
           106, 107, 108, 109, 110],
    'NAME': ['Jagruti', 'Pavan', 'Harish',
             'Pooja', 'Rahul', 'Niharika',
             'Sachin', 'Atul', 'Dean', "Monish"],
    'course': ['DAC', 'DBDA', 'DBDA', 'DBDA', 'DBDA',
               'DAC', 'DAC', 'DAC', 'DBDA', 'DBDA']})

# Creating Dataframe
placement_details = pd.DataFrame(
    {'Prn_No': [101, 102, 103, 104, 105,
            106, 107, 108, 109, 110],
     'status': ['placed', 'not_placed', 'placed',
                 'placed', 'not_placed', 'not_placed',
                 'placed', 'not_placed', 'placed', 'not_placed']})

# Merging Dataframe
print(pd.merge(students_data, placement_details, on='Prn_No'))

   Prn_No      NAME course      status
0     101   Jagruti    DAC      placed
1     102     Pavan   DBDA  not_placed
2     103    Harish   DBDA      placed
3     104     Pooja   DBDA      placed
4     105     Rahul   DBDA  not_placed
5     106  Niharika    DAC  not_placed
6     107    Sachin    DAC      placed
7     108      Atul    DAC  not_placed
8     109      Dean   DBDA      placed
9     110    Monish   DBDA  not_placed

In [54]:
# Creating Dataframe
students_data = pd.DataFrame({
    'Prn_No': [101, 102, 103, 104, 105,
           106, 107, 108, 109, 110],
    'NAME': ['Jagruti', 'Pavan', 'Harish',
             'Pooja', 'Rahul', 'Niharika',
             'Sachin', 'Atul', 'Dean', "Manish"],
    'course': ['DAC', 'DBDA', 'DBDA', 'DBDA', 'DBDA',
               'DAC', 'DAC', 'DAC', 'DBDA', 'DBDA'],
    'project_marks': [94,82,75,98,65,58,73,63,90,72]
})

students_data

   Prn_No      NAME course  project_marks
0     101   Jagruti    DAC             94
1     102     Pavan   DBDA             82
2     103    Harish   DBDA             75
3     104     Pooja   DBDA             98
4     105     Rahul   DBDA             65
5     106  Niharika    DAC             58
6     107    Sachin    DAC             73
7     108      Atul    DAC             63
8     109      Dean   DBDA             90
9     110    Manish   DBDA             72

In [56]:
students_data = students_data.rename(columns={'project_marks': 'Project_grade'})
grade=""
for marks in students_data["Project_grade"]:
    if marks>=90:
        grade='A'
    elif marks>70 and marks<90:
        grade='B'
    else:
        grade='C'
    students_data["Project_grade"]=students_data["Project_grade"].replace({marks:grade})

students_data

   Prn_No      NAME course Project_grade
0     101   Jagruti    DAC             A
1     102     Pavan   DBDA             B
2     103    Harish   DBDA             B
3     104     Pooja   DBDA             A
4     105     Rahul   DBDA             C
5     106  Niharika    DAC             C
6     107    Sachin    DAC             B
7     108      Atul    DAC             C
8     109      Dean   DBDA             A
9     110    Manish   DBDA             B

In [60]:
# Sample DataFrame
data = {'Technology': ['Python', 'Java', 'DotNet', 'ML'],
        'Project_grades': ['A', 'B', 'A', 'B'],
        'No_of_students': [10, 15, 20, 25]}

df = pd.DataFrame(data)

# Display the original DataFrame
print("Original DataFrame:")
df

Original DataFrame:

  Technology Project_grades  No_of_students
0     Python              A              10
1       Java              B              15
2     DotNet              A              20
3         ML              B              25

In [62]:
# Create a pivot table
pivot_table = df.pivot_table(index='Technology', columns='Project_grades', values='No_of_students', aggfunc='sum')
value=['A','B']
pivot_table=pivot_table.fillna(0)  # try without this
pivot_table[value] = pivot_table[value].astype(int) # try without this

# Display the pivot table
print("\nPivot Table:")
pivot_table

Pivot Table:

Project_grades   A   B
Technology
DotNet          20   0
Java             0  15
ML               0  25
Python          10   0

In [64]:
import re

proid = [1, 2, 3, 4]
proname = ["Soap", "Perfume", "Deo", "Body_Wash"]
price = [120, 400, 250, 180]

# dictionary of lists
mydictionary1 = {'proid': proid, 'proname': proname, 'price': price}

mydataframe1 = pd.DataFrame(mydictionary1)
mydataframe1

   proid    proname  price
0      1       Soap    120
1      2    Perfume    400
2      3        Deo    250
3      4  Body_Wash    180

In [78]:
print("\nproducts where price more than 200\n")
mydataframe1[mydataframe1.price > 200]

products where price more than 200

   proid  proname  price
1      2  Perfume    400
2      3      Deo    250

In [82]:
mydataframe1[(mydataframe1.price >= 200) & (mydataframe1.price <= 300)]

   proid proname  price
2      3     Deo    250

In [84]:
pronames = ['Soap', 'Deo']
mydataframe1[mydataframe1.proname.isin(pronames)]

   proid proname  price
0      1    Soap    120
2      3     Deo    250

In [86]:
pronames = ['Soap', 'Deo']
mydataframe1[~mydataframe1.proname.isin(pronames)]

   proid    proname  price
1      2    Perfume    400
3      4  Body_Wash    180

In [88]:
pronames = ['soAp', 'dEo']
mydataframe1[mydataframe1.proname.str.fullmatch('soAp|deO', case=False)]

   proid proname  price
0      1    Soap    120
2      3     Deo    250

In [90]:
mydataframe1[mydataframe1.proname.str.startswith('D')]

   proid proname  price
2      3     Deo    250

In [92]:
mydataframe1[mydataframe1.proname.str.contains('e')]

   proid  proname  price
1      2  Perfume    400
2      3      Deo    250

In [98]:
mydataframe1.nlargest(2,'price')#products with the largest values
#2 rows in descending order of price

   proid  proname  price
1      2  Perfume    400
2      3      Deo    250

In [100]:
mydataframe1.nsmallest(2, 'price')

   proid    proname  price
0      1       Soap    120
3      4  Body_Wash    180